<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"35cb87a78005534a56aa340de01c7695b3a54b6ca48be1c771deef541d92f023","plan_job_ref":"Job Terraform plan #29 at https://github.com/mkuthan/stream-processing/actions/runs/7251204604","plan_hash":"694f1a96dae4881d5d36104160b325bdeac392eb327e1d2c4a93795b8debd629","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan in __toll-infrastructure__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_pubsub_subscription.toll-booth-entry-subscription will be created
  + resource "google_pubsub_subscription" "toll-booth-entry-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "toll-booth-entry"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = "projects/playground-272019/topics/toll-booth-entry"
    }

  # google_pubsub_subscription.toll-booth-exit-subscription will be created
  + resource "google_pubsub_subscription" "toll-booth-exit-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "toll-booth-exit"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = "projects/playground-272019/topics/toll-booth-exit"
    }

  # google_pubsub_subscription.vehicle-registration-subscription will be created
  + resource "google_pubsub_subscription" "vehicle-registration-subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "vehicle-registration"
      + project                    = "playground-272019"
      + terraform_labels           = (known after apply)
      + topic                      = "projects/playground-272019/topics/vehicle-registration"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #29](https://github.com/mkuthan/stream-processing/actions/runs/7251204604)